TexasInstruments/mcupsdk-core/test/drivers/dac/am263px-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --package "ZCZ_C" --part "AM263P4" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.17.0+3128"}
 */

/**
 * Import the modules used in this configuration.
 */
const edma       = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1      = edma.addInstance();
const epwm       = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1      = epwm.addInstance();
const epwm2      = epwm.addInstance();
const epwm3      = epwm.addInstance();
const epwm4      = epwm.addInstance();
const epwm5      = epwm.addInstance();
const epwm6      = epwm.addInstance();
const epwm7      = epwm.addInstance();
const epwm8      = epwm.addInstance();
const epwm9      = epwm.addInstance();
const epwm10     = epwm.addInstance();
const epwm11     = epwm.addInstance();
const epwm12     = epwm.addInstance();
const epwm13     = epwm.addInstance();
const epwm14     = epwm.addInstance();
const epwm15     = epwm.addInstance();
const epwm16     = epwm.addInstance();
const epwm17     = epwm.addInstance();
const epwm18     = epwm.addInstance();
const epwm19     = epwm.addInstance();
const epwm20     = epwm.addInstance();
const epwm21     = epwm.addInstance();
const epwm22     = epwm.addInstance();
const epwm23     = epwm.addInstance();
const epwm24     = epwm.addInstance();
const epwm25     = epwm.addInstance();
const epwm26     = epwm.addInstance();
const epwm27     = epwm.addInstance();
const epwm28     = epwm.addInstance();
const epwm29     = epwm.addInstance();
const epwm30     = epwm.addInstance();
const epwm31     = epwm.addInstance();
const epwm32     = epwm.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const timer      = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1     = timer.addInstance();
const general    = scripting.addModule("/memory_configurator/general", {}, false);
const general1   = general.addInstance();
const region     = scripting.addModule("/memory_configurator/region", {}, false);
const region1    = region.addInstance();
const section    = scripting.addModule("/memory_configurator/section", {}, false);
const section1   = section.addInstance();
const section2   = section.addInstance();
const section3   = section.addInstance();
const section4   = section.addInstance();
const section5   = section.addInstance();
const section6   = section.addInstance();
const section7   = section.addInstance();
const section8   = section.addInstance();
const section9   = section.addInstance();
const section10  = section.addInstance();
const section11  = section.addInstance();
const section12  = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
edma1.$name                 = "CONFIG_EDMA0";
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

epwm1.$name        = "CONFIG_EPWM0";
epwm1.EPWM.$assign = "EPWM28";

epwm2.$name = "CONFIG_EPWM1";

epwm3.$name = "CONFIG_EPWM2";

epwm4.$name = "CONFIG_EPWM3";

epwm5.$name = "CONFIG_EPWM4";

epwm6.$name = "CONFIG_EPWM5";

epwm7.$name = "CONFIG_EPWM6";

epwm8.$name = "CONFIG_EPWM7";

epwm9.$name = "CONFIG_EPWM8";

epwm10.$name = "CONFIG_EPWM9";

epwm11.$name = "CONFIG_EPWM10";

epwm12.$name = "CONFIG_EPWM11";

epwm13.$name = "CONFIG_EPWM12";

epwm14.$name = "CONFIG_EPWM13";

epwm15.$name = "CONFIG_EPWM14";

epwm16.$name = "CONFIG_EPWM15";

epwm17.$name = "CONFIG_EPWM16";

epwm18.$name = "CONFIG_EPWM17";

epwm19.$name = "CONFIG_EPWM18";

epwm20.$name = "CONFIG_EPWM19";

epwm21.$name = "CONFIG_EPWM20";

epwm22.$name = "CONFIG_EPWM21";

epwm23.$name = "CONFIG_EPWM22";

epwm24.$name = "CONFIG_EPWM23";

epwm25.$name = "CONFIG_EPWM24";

epwm26.$name = "CONFIG_EPWM25";

epwm27.$name = "CONFIG_EPWM26";

epwm28.$name = "CONFIG_EPWM27";

epwm29.$name = "CONFIG_EPWM28";

epwm30.$name = "CONFIG_EPWM29";

epwm31.$name = "CONFIG_EPWM30";

epwm32.$name = "CONFIG_EPWM31";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

timer1.$name = "CONFIG_TIMER0";

general1.$name        = "CONFIG_GENERAL0";
general1.linker.$name = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION";
region1.memory_region.create(12);
region1.memory_region[0].type                = "TCMA";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].auto                = false;
region1.memory_region[0].size                = 0x40;

