TexasInstruments/mcupsdk-core/test/drivers/dac/am263px-lp/r5fss0-0_nortos/example.syscfg
region1.memory_region[1].type                = "TCMA";
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[2].type                = "TCMB";
region1.memory_region[2].$name               = "R5F_TCMB";
region1.memory_region[2].size                = 0x8000;
region1.memory_region[3].$name               = "SBL";
region1.memory_region[3].size                = 0x40000;
region1.memory_region[4].$name               = "OCRAM";
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x70040000;
region1.memory_region[4].size                = 0x40000;
region1.memory_region[5].type                = "FLASH";
region1.memory_region[5].auto                = false;
region1.memory_region[5].manualStartAddress  = 0x60100000;
region1.memory_region[5].size                = 0x80000;
region1.memory_region[5].$name               = "FLASH";
region1.memory_region[6].$name               = "USER_SHM_MEM";
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x701D0000;
region1.memory_region[6].size                = 0x4000;
region1.memory_region[6].isShared            = true;
region1.memory_region[6].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[7].$name               = "LOG_SHM_MEM";
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x701D4000;
region1.memory_region[7].size                = 0x4000;
region1.memory_region[7].isShared            = true;
region1.memory_region[7].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[8].type                = "CUSTOM";
region1.memory_region[8].$name               = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[8].auto                = false;
region1.memory_region[8].manualStartAddress  = 0x72000000;

region1.memory_region[8].isShared            = true;
region1.memory_region[8].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[8].size                = 0x3E80;
region1.memory_region[9].type                = "CUSTOM";
region1.memory_region[9].$name               = "MAILBOX_HSM";
region1.memory_region[9].auto                = false;
region1.memory_region[9].manualStartAddress  = 0x44000000;
region1.memory_region[9].size                = 0x3CE;
region1.memory_region[9].isShared            = true;
region1.memory_region[9].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[10].type               = "CUSTOM";
region1.memory_region[10].$name              = "MAILBOX_R5F";
region1.memory_region[10].auto               = false;
region1.memory_region[10].manualStartAddress = 0x44000400;
region1.memory_region[10].size               = 0x3CE;
region1.memory_region[10].isShared           = true;
region1.memory_region[10].shared_cores       = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[11].type               = "CUSTOM";
region1.memory_region[11].$name              = "MSS_CTRL";
region1.memory_region[11].auto               = false;
region1.memory_region[11].manualStartAddress = 0x50D00000;
region1.memory_region[11].size               = 0x4000;
region1.memory_region[11].isShared           = true;
region1.memory_region[11].shared_cores       = ["r5fss0-1","r5fss1-0","r5fss1-1"];

section1.load_memory             = "R5F_VECS";
section1.group                   = false;
section1.$name                   = "Vector Table";
section1.output_section.create(1);
section1.output_section[0].$name = ".vectors";

section2.load_memory             = "OCRAM";
section2.$name                   = "Text Segments";
section2.output_section.create(5);
section2.output_section[0].$name = ".text.hwi";
section2.output_section[1].$name = ".text.cache";
section2.output_section[2].$name = ".text.mpu";
section2.output_section[3].$name = ".text.boot";
section2.output_section[4].$name = ".text:abort";

section3.load_memory             = "OCRAM";
section3.$name                   = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name = ".text";
section3.output_section[1].$name = ".rodata";

section4.load_memory             = "OCRAM";
section4.$name                   = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name = ".data";

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[2].$name                 = ".stack";

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.load_memory             = "OCRAM";
section7.$name                   = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name = ".ARM.exidx";
section7.output_section[1].$name = ".init_array";
section7.output_section[2].$name = ".fini_array";

section8.load_memory             = "USER_SHM_MEM";
section8.type                    = "NOLOAD";
section8.$name                   = "User Shared Memory";
section8.group                   = false;
section8.output_section.create(1);
section8.output_section[0].$name = ".bss.user_shared_mem";

section9.load_memory             = "LOG_SHM_MEM";
section9.$name                   = "Log Shared Memory";
section9.group                   = false;
section9.output_section.create(1);
section9.output_section[0].$name = ".bss.log_shared_mem";

section10.load_memory             = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                    = "NOLOAD";
section10.$name                   = "IPC Shared Memory";
section10.group                   = false;
section10.output_section.create(1);
section10.output_section[0].$name = ".bss.ipc_vring_mem";

section11.load_memory             = "MAILBOX_HSM";
section11.type                    = "NOLOAD";
section11.$name                   = "SIPC HSM Queue Memory";
section11.group                   = false;
section11.output_section.create(1);
section11.output_section[0].$name = ".bss.sipc_hsm_queue_mem";

section12.load_memory             = "MAILBOX_R5F";
section12.$name                   = "SIPC R5F Queue Memory";
section12.group                   = false;
section12.output_section.create(1);
section12.output_section[0].$name = ".bss.sipc_secure_host_queue_mem";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO11";
epwm1.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO12";
epwm2.EPWM.$suggestSolution             = "EPWM31";
epwm2.EPWM.A.$suggestSolution           = "PR0_PRU1_GPIO10";
epwm2.EPWM.B.$suggestSolution           = "PR0_PRU1_GPIO8";
epwm3.EPWM.$suggestSolution             = "EPWM30";
epwm3.EPWM.A.$suggestSolution           = "PR0_PRU1_GPIO5";
epwm3.EPWM.B.$suggestSolution           = "PR0_PRU1_GPIO9";
epwm4.EPWM.$suggestSolution             = "EPWM29";
epwm4.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO13";
epwm4.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO14";
epwm5.EPWM.$suggestSolution             = "EPWM27";
epwm5.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO16";
epwm5.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO15";
epwm6.EPWM.$suggestSolution             = "EPWM26";
epwm6.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO2";
epwm6.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO3";
epwm7.EPWM.$suggestSolution             = "EPWM25";
epwm7.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO0";
epwm7.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO1";
epwm8.EPWM.$suggestSolution             = "EPWM24";
epwm8.EPWM.A.$suggestSolution           = "PR0_PRU0_GPIO6";
epwm8.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO4";
epwm9.EPWM.$suggestSolution             = "EPWM23";
epwm9.EPWM.A.$suggestSolution           = "PR0_PRU1_GPIO0";
epwm9.EPWM.B.$suggestSolution           = "PR0_PRU0_GPIO8";
epwm10.EPWM.$suggestSolution            = "EPWM22";
epwm10.EPWM.A.$suggestSolution          = "PR0_PRU0_GPIO5";
epwm10.EPWM.B.$suggestSolution          = "PR0_PRU0_GPIO10";
epwm11.EPWM.$suggestSolution            = "EPWM21";
epwm11.EPWM.A.$suggestSolution          = "PR0_MDIO_MDIO";
epwm11.EPWM.B.$suggestSolution          = "PR0_MDIO_MDC";
epwm12.EPWM.$suggestSolution            = "EPWM20";
epwm12.EPWM.A.$suggestSolution          = "MMC_SDWP";
epwm12.EPWM.B.$suggestSolution          = "MMC_SDCD";
epwm13.EPWM.$suggestSolution            = "EPWM19";
epwm13.EPWM.A.$suggestSolution          = "MMC_DAT2";
epwm13.EPWM.B.$suggestSolution          = "MMC_DAT3";
epwm14.EPWM.$suggestSolution            = "EPWM18";
epwm14.EPWM.A.$suggestSolution          = "MMC_DAT0";
epwm14.EPWM.B.$suggestSolution          = "MMC_DAT1";
epwm15.EPWM.$suggestSolution            = "EPWM17";
epwm15.EPWM.A.$suggestSolution          = "MMC_CLK";
epwm15.EPWM.B.$suggestSolution          = "MMC_CMD";
epwm16.EPWM.$suggestSolution            = "EPWM16";
epwm16.EPWM.A.$suggestSolution          = "PR0_PRU1_GPIO11";
epwm16.EPWM.B.$suggestSolution          = "PR0_PRU1_GPIO12";
epwm17.EPWM.$suggestSolution            = "EPWM15";
epwm17.EPWM.A.$suggestSolution          = "RGMII1_TD0";
epwm17.EPWM.B.$suggestSolution          = "RGMII1_TX_CTL";
epwm18.EPWM.$suggestSolution            = "EPWM14";
epwm18.EPWM.A.$suggestSolution          = "RGMII1_RXC";
epwm18.EPWM.B.$suggestSolution          = "RGMII1_TXC";
epwm19.EPWM.$suggestSolution            = "EPWM13";
epwm19.EPWM.A.$suggestSolution          = "EPWM13_A";
epwm19.EPWM.B.$suggestSolution          = "EPWM13_B";
epwm20.EPWM.$suggestSolution            = "EPWM12";
epwm20.EPWM.A.$suggestSolution          = "EPWM12_A";
epwm20.EPWM.B.$suggestSolution          = "OSPI0_D0";
epwm21.EPWM.$suggestSolution            = "EPWM11";
epwm21.EPWM.A.$suggestSolution          = "EPWM11_A";
epwm21.EPWM.B.$suggestSolution          = "EPWM11_B";
epwm22.EPWM.$suggestSolution            = "EPWM10";
epwm22.EPWM.A.$suggestSolution          = "EPWM12_B";
epwm22.EPWM.B.$suggestSolution          = "EPWM10_B";
epwm23.EPWM.$suggestSolution            = "EPWM9";
epwm23.EPWM.A.$suggestSolution          = "EPWM9_A";
epwm23.EPWM.B.$suggestSolution          = "EPWM9_B";
epwm24.EPWM.$suggestSolution            = "EPWM8";
epwm24.EPWM.A.$suggestSolution          = "EPWM8_A";
epwm24.EPWM.B.$suggestSolution          = "EPWM8_B";
epwm25.EPWM.$suggestSolution            = "EPWM7";
epwm25.EPWM.A.$suggestSolution          = "EPWM7_A";
epwm25.EPWM.B.$suggestSolution          = "EPWM10_A";
epwm26.EPWM.$suggestSolution            = "EPWM6";
epwm26.EPWM.A.$suggestSolution          = "EPWM6_A";
epwm26.EPWM.B.$suggestSolution          = "EPWM6_B";
epwm27.EPWM.$suggestSolution            = "EPWM5";
epwm27.EPWM.A.$suggestSolution          = "EPWM5_A";
epwm27.EPWM.B.$suggestSolution          = "EPWM5_B";
epwm28.EPWM.$suggestSolution            = "EPWM4";
epwm28.EPWM.A.$suggestSolution          = "EPWM4_A";
epwm28.EPWM.B.$suggestSolution          = "EPWM4_B";
epwm29.EPWM.$suggestSolution            = "EPWM3";
epwm29.EPWM.A.$suggestSolution          = "EPWM3_A";
epwm29.EPWM.B.$suggestSolution          = "EPWM3_B";
epwm30.EPWM.$suggestSolution            = "EPWM2";
epwm30.EPWM.A.$suggestSolution          = "EPWM2_A";
epwm30.EPWM.B.$suggestSolution          = "EPWM2_B";
epwm31.EPWM.$suggestSolution            = "EPWM1";
epwm31.EPWM.A.$suggestSolution          = "EPWM1_A";
epwm31.EPWM.B.$suggestSolution          = "EPWM1_B";
epwm32.EPWM.$suggestSolution            = "EPWM0";
epwm32.EPWM.A.$suggestSolution          = "EPWM0_A";
epwm32.EPWM.B.$suggestSolution          = "EPWM0_B";
debug_log.uartLog.UART.$suggestSolution = "UART0";
timer1.RTI.$suggestSolution             = "RTI1";
